Repository: bluedev41/eCard-wordpress-php-
Catalog: languages/ecards-*.po
Languages: ro_ro

source: Options updated successfully!
ro_ro: Optiunile au fost actualizate cu success!

source: Home
ro_ro: Acasa

source: Settings
ro_ro: Optiuni

source: Email Options
ro_ro: Optiuni email

source: Restrictions &amp; Payment
ro_ro: Restrictii si plati

source: Diagnostics
ro_ro: Diagnostic

source: eCards Sender
ro_ro: Expeditor eCard

source: eCard sent successfully!
ro_ro: Felicitarea a fost trimisa cu succes!

source: Upload image
ro_ro: Incarca imagine

source: Your name
ro_ro: Nume

source: Your email address
ro_ro: Adresa email

source: Your friend's email address
ro_ro: Adresa email prieten

source: eCard message
ro_ro: Mesaj felicitare

source: Send a copy to self
ro_ro: Trimite copie (CC)
